from database.functions import DistrictManager, StreetManager
from database.engine import session_maker
import asyncio

districts = ['Нукус шахар', 'Амударё туман', 'Беруний туман', 'Бўзатов туман', 'Кегейли туман',
 'Қонликўл туман', 'Қораўзак туман', 'Қўнғирот туман', 'Мўйноқ туман', 'Нукус туман',
 'Тахиатош туман', 'Тахтакўпир туман', 'Тўрткўл туман', 'Хўжайли туман', 'Чимбой туман',
 'Шўманой туман', 'Элликқалъа туман']


streets_1 = [
    "Дәрбент МПЖ", "Жеке терек МПЖ", "Темир жол МПЖ", "Жаңабазар МПЖ", "Қызыл қум МПЖ",
    "Жайхун МПЖ", "Наўрыз МПЖ", "Наўқан бағ МПЖ", "Жуўазшы МПЖ", "Бес төбе МПЖ",
    "Қаратаў МПЖ", "Гүзар МПЖ", "Берекет МПЖ", "Нәўбәҳар МПЖ", "Жипек жолы МПЖ",
    "Ҳаўа жоллары МПЖ", "Айдын жол МПЖ", "Шымбай чайхана МПЖ", "Ботаника бағы МПЖ", "Шығыс МПЖ",
    "Таслақ МПЖ", "Жолшылар МПЖ", "Қум аўыл МПЖ", "Қутлы қоныс МПЖ", "Алланияз Қаҳарман МПЖ",
    "Қутлы мәкан МПЖ", "Дослық гүзары МПЖ", "Шымбай гүзары МПЖ", "Ата мәкан МПЖ", "Узын көл МПЖ",
    "Аманлық гузары МПЖ", "Халықлар дослығы МПЖ", "Шайырлар аўылы МПЖ", "Тынышлық МПЖ", "Дослық МПЖ",
    "Сәрбиназ МПЖ", "Туңғыш қоныс МПЖ", "Қурылысшы МПЖ", "Қос көл МПЖ", "Алмазар МПЖ",
    "Ели абат МПЖ", "Өрнек МПЖ", "Нур МПЖ", "Бақшылық МПЖ", "Ақ отаў МПЖ",
    "Ғәрезсизлик МПЖ", "Гүлзар МПЖ", "Ватанпарвар МПЖ", "Байтерек МПЖ", "Нәўпир МПЖ",
    "Каттағар МПЖ", "Гөне қала МПЖ", "Туран МПЖ", "Көк өзек МПЖ", "Қос булақ МПЖ",
    "Жийдели байсын МПЖ", "Амударья МПЖ", "Ақ жағыс МПЖ", "Саманбай МПЖ", "Анасай МПЖ",
    "Боз аўыл МПЖ", "Қумбыз аўыл МПЖ", "Теле орай МПЖ", "Алтын жагыс МПЖ", "Жасыл бағ МПЖ",
    "Жанга заман МПЖ", "Нурлы бостан МПЖ", "Абат макан МПЖ", "Жас аўлад МПЖ", "Шадлы аўыл МПЖ",
    "Исбилерменлер аймағы МПЖ"
]

streets_2 = [
    "Беш том МПЖ", "Босув МПЖ", "Гулзор МПЖ", "Дарё бўйи МПЖ", "Қипчоқ АПЖ",
    "Қипчоқ ППЖ", "Ойбек МПЖ", "Олмазор МПЖ", "Тўлқин АПЖ", "Уйшин МПЖ",
    "Чойкўл АПЖ", "Назархон АПЖ", "Аёқчи МПЖ", "Амир Темур АПЖ", "Арна бўйи МПЖ",
    "Беш овул МПЖ", "Боғ МПЖ", "Бўз солма МПЖ", "Дўрман АПЖ", "Дўстлик МПЖ",
    "Қиличбой АПЖ", "Қорамон МПЖ", "Тош қалъа МПЖ", "Ўрта қалъа АПЖ", "Фаровон МПЖ",
    "Хизр эли МПЖ", "Холимбег АПЖ", "Юқори қишлоқ МПЖ", "Янгиобод МПЖ", "Бойовул МПЖ",
    "Бўз ёп АПЖ", "Дурунки МПЖ", "Жумур овул МПЖ", "Жумуртов ППЖ", "З.М.Бобур АПЖ",
    "Куюк кўпир АПЖ", "Қизилчоли МПЖ", "Оқ олтин АПЖ", "Тор ёп МПЖ", "Ўзбекистон МПЖ",
    "Хитой АПЖ", "Қангли АПЖ", "Қум ёп МПЖ", "Алишер Навоий МПЖ", "Беруний МПЖ",
    "Бўстон МПЖ", "Намуна МПЖ", "Тош ёп АПЖ", "Чордара МПЖ"
]

streets_3 = [
    "Олтинсой АПЖ", "Бийбозор АПЖ", "Абай АПЖ", "Беруний АПЖ", "Мустақиллик МПЖ",
    "Қангшартол МПЖ", "Найман МПЖ", "Хоразм МПЖ", "Гулистон МПЖ", "Қият МПЖ",
    "Тинчлик АПЖ", "Навоий АПЖ", "Лолазор МПЖ", "Саркоп АПЖ", "Палваш МПЖ",
    "Жуманиязов МПЖ", "Бўстон МПЖ", "Пахтакор МПЖ", "Наврўз МПЖ", "Бирлик МПЖ",
    "Дўстлик АПЖ", "Қизил-қалъа АПЖ", "Озод АПЖ", "Махтумқули АПЖ", "Амир Темур МПЖ",
    "Навоий МПЖ", "Дўстлик МПЖ", "Янгиобод МПЖ", "Жайҳун МПЖ", "Шимом АПЖ",
    "Оби ҳаёт МПЖ", "Шаббоз АПЖ", "Турон МПЖ", "Ибн Сино МПЖ", "Бунёдкор МПЖ",
    "Истиқлол МПЖ", "Шаббоз МПЖ", "Марказий МПЖ", "Тўқимачи МПЖ", "Саройкул МПЖ"
]

streets_4 = [
    "Бозатаў ПФЙ", "Аспантай АПЖ", "Қусханатаў АПЖ", "Көк-суў АПЖ", "Еркиндарья АПЖ"
]

streets_5 = [
    "Абат АПЖ", "Абат мәкан МПЖ", "Ақтуба АПЖ", "Халкабад МПЖ", "Бахытлы МПЖ",
    "Гужим терек МПЖ", "Жалпақ жап МПЖ", "Жаңабазар АПЖ", "Жүзимбағ АПЖ", "Жылўан жап МПЖ",
    "Ийшан қала АПЖ", "Кѳкѳзек АПЖ", "Қумшүнгил АПЖ", "Қуяшлы МПЖ", "Мәденият МПЖ",
    "Нурлы бостан МПЖ"
]

streets_6 = [
    "Бескөпир АПЖ", "Наўрыз АПЖ", "Алтынкөл АПЖ", "Жаңа қала АПЖ", "Бостан АПЖ",
    "Мәденият МПЖ", "Сары алтын АПЖ", "Жайҳун МПЖ", "Дўстлик МПЖ", "Қаңлыкөл ППЖ",
    "Арзымбетқум АПЖ"
]

streets_7 = [
    "Бердақ АПЖ", "Есим МПЖ", "Академик С.Камалов АПЖ", "Қойбақ АПЖ", "Аллаяр Досназаров АПЖ",
    "Қуралпа АПЖ", "Мәденият АПЖ", "Ғәрезсизлик гүзары МПЖ", "Ата-мәкан МПЖ", "Қараөзек ППЖ",
    "Қутлы мәкан МПЖ", "Қараөзек АПЖ", "Есимөзек АПЖ"
]

streets_8 = [
    "Түркистан МПЖ", "Ажинияз АПЖ", "Көкдәрья АПЖ", "Үстирт АПЖ", "Моншақлы МПЖ",
    "Тарақлы МПЖ", "Жиңишке МПЖ", "Ҳәким-ата МПЖ", "Қарақалпақстан ППЖ", "Туран МПЖ",
    "Өрнек АПЖ", "Ханжап МПЖ", "Гүлабад МПЖ", "Қашы МПЖ", "Алмазар МПЖ",
    "Қоңырат МПЖ", "Қаратал МПЖ", "Қырққыз ППЖ", "Қанглы АПЖ", "Қумбыз МПЖ",
    "Алтынкөл ППЖ", "Навоий МПЖ", "Қыпшақ АПЖ", "Бердақ МПЖ", "Әдебият АПЖ",
    "Таллық МПЖ", "Хорезм АПЖ", "Елабад МПЖ", "Қыят АПЖ", "Жаслық МПЖ",
    "Рәўшан АПЖ", "Қоңырат АПЖ", "Мыңжарған МПЖ", "Бостан МПЖ", "Суўенли АПЖ",
    "Азатлық МПЖ", "Санаат МПЖ", "Мийнетабат АПЖ", "Темиржол МПЖ"
]

streets_9 = [
    "Мойнақ МПЖ", "Арал МПЖ", "Жайҳун МПЖ", "Таллы өзек МПЖ", "Дослық МПЖ",
    "Үшсай АПЖ", "Тик өзек АПЖ", "Бозатаў АПЖ", "Мәдели АПЖ", "Ҳәким ата АПЖ",
    "Қызыл жар АПЖ", "Қазақдарья АПЖ"
]

streets_10 = [
    "Қырантаў АПЖ", "Тақыркөл АПЖ", "Ақтерек МПЖ", "Бақаншақлы АПЖ", "Қутанкөл МПЖ",
    "Арбашы АПЖ", "Кердер АПЖ", "Төк таў МПЖ", "Ақманғыт ППЖ", "Саманбай АПЖ",
    "Дарсан МПЖ", "Дийхан арна МПЖ", "Улгили макан МПЖ"
]

streets_11 = [
    "Атакөл АПЖ", "Дәўир МПЖ", "Жаңадарья АПЖ", "Айдын жол МПЖ", "Белтаў АПЖ",
    "Дәўқара АПЖ", "Қаратерен МПЖ", "Ғәрезсизлик МПЖ", "Маржанкөл МПЖ", "Қара-ой АПЖ",
    "Өзбекстан МПЖ", "А.Адилов АПЖ", "Даўытсай МПЖ", "Қоныраткол АПЖ", "Қоструба МПЖ",
    "Мулик АПЖ", "Тахтакөпир ПФЙ"
]

streets_12 = [
    "Дослық МПЖ", "Найманкөл АПЖ", "Нурлы келешек МПЖ", "Айдын жол МПЖ", "Кенегес АПЖ",
    "Тақыятас МПЖ", "Қусшылық МПЖ", "Сарайкөл АПЖ", "Шамшырақ МПЖ", "Абат мәкан МПЖ",
    "Жайҳун МПЖ", "Халықлар дослығы МПЖ", "Орайлық МПЖ", "Янги макон АПЖ"
]

streets_13 = [
    "Дўстлик МПЖ", "Ёшлик МПЖ", "Жайҳун МПЖ", "Истиқлол МПЖ", "Наврўз МПЖ",
    "Пахтачи АПЖ", "Шўрахон АПЖ", "Ёнбошқалъа АПЖ", "Анҳорли МПЖ", "Кўна-Тўрткўл АПЖ",
    "Шодлик МПЖ", "Беруний МПЖ", "Ўзбекистон АПЖ", "Калтаминор АПЖ", "Пахтаобод АПЖ",
    "Атауба АПЖ", "Машъал МПЖ", "Гулистон МПЖ", "Янгиобод МПЖ", "Ибн-Сино МПЖ",
    "Мустақиллик МПЖ", "Боғёп МПЖ", "Навоий МПЖ", "Оққамиш АПЖ", "Оқбошли АПЖ",
    "Отаюрт АПЖ", "Кўкча АПЖ", "Тўрткўл МПЖ", "Туркистон МПЖ", "Марказобод МПЖ",
    "Тошкент МПЖ", "Ғалаба МПЖ", "Ўзбекистон МПЖ", "Тинчлик МПЖ", "Уллубоғ АПЖ",
    "Тозабоғёп АПЖ", "Қумбосган АПЖ", "Зиёкор МПЖ", "Яшнобод МПЖ", "Нурли йўл МПЖ",
    "Нурли Уллибоғ МПЖ", "Мискин МПЖ", "Тозабўзёп МПЖ", "Яхдиллик МПЖ", "Туркман йўли МПЖ",
    "Янги ҳаёт МПЖ", "Нурота МПЖ", "Бахор МПЖ", "Базирган МПЖ"
]

streets_14 = [
    "Шағалакөл МПЖ", "Қирқинчи МПЖ", "Қумбыз МПЖ", "Мәденият МПЖ", "Байтерек МПЖ",
    "Қулаб АПЖ", "Қумжыққын АПЖ", "Таскөпир МПЖ", "Жаңа жап АПЖ", "Кун нуры МПЖ",
    "Жан Қоңырат МПЖ", "Пәрўаз МПЖ", "Жайҳун ППЖ", "Абат МПЖ", "Саманкөл АПЖ",
    "Тынышлық МПЖ", "Бунёдкор МПЖ", "Муртазабий МПЖ", "Сарышүңгил АПЖ", "Наврўз МПЖ",
    "Мустақиллик АПЖ", "Сүўенли МПЖ", "Амударья АПЖ", "Нурлы жол МПЖ", "Жүзимзар МПЖ",
    "Тутзар МПЖ", "Бағман АПЖ", "Сабик МПЖ"
]

streets_15 = [
    "Гүжимли МПЖ", "Абат мәкан МПЖ", "Дослық МПЖ", "Шахтемир МПЖ", "Жипек жолы МПЖ",
    "Көкши қала МПЖ", "Қаракөл МПЖ", "Бердақ МПЖ", "Оржап МПЖ", "Темир жол гүзары МПЖ",
    "Көнши МПЖ", "Гүлистан МПЖ", "Тазғара АПЖ", "Тағ жап АПЖ", "Кеңес АПЖ",
    "Қостерек АПЖ", "Таза жол АПЖ", "Бахытлы АПЖ", "Май жап АПЖ", "Пәшент таў АПЖ",
    "Қамыс арық АПЖ", "Қызыл өзек АПЖ"
]

streets_16 = [
    "Мамый АПЖ", "Ақ жап АПЖ", "Айбуйир МПЖ", "Моншақлы МПЖ", "Дийханабад АПЖ",
    "Кетенлер АПЖ", "Қарабайлы МПЖ", "Бегжап АПЖ", "Бирлешик АПЖ", "Наўрыз МПЖ",
    "Таза базар МПЖ", "Мәденият МПЖ", "Сарманбайкөл АПЖ"
]

streets_17 = [
    "Гулдурсун АПЖ", "Гулистон АПЖ", "Жасорат МПЖ", "Қизилқум АПЖ", "Қирққизобод АПЖ",
    "Навбаҳор МПЖ", "Оқ олтин МПЖ", "Сахтиён ППЖ", "Тоза-боғ АПЖ", "Чуқурқоқ МПЖ",
    "Янги Ўзбекистон МПЖ", "Ақчакўл АПЖ", "Ифтиҳор МПЖ", "Кичик Гулдурсун МПЖ", "Навоий АПЖ",
    "Тупроққалъа МПЖ", "Шарқ Юлдузи АПЖ", "Амиробод АПЖ", "Думанқалъа МПЖ", "Дўстлик АПЖ",
    "Ихлос МПЖ", "Коинот МПЖ", "Қиличиноқ АПЖ", "Қошқўра МПЖ", "Пахтачи МПЖ",
    "Сарабий АПЖ", "Чўпон МПЖ", "Абай МПЖ", "А.Навоий МПЖ", "Аязқалъа МПЖ",
    "Бўстон МПЖ", "Ибн Сино МПЖ", "Иқбол МПЖ", "Истиқлол МПЖ", "Қаватқалъа МПЖ",
    "Тошкент МПЖ", "Элликқалъа АПЖ", "Бургутқалъа МПЖ", "Тўрт девор МПЖ", "Барҳаёт МПЖ"
]


async def main_1():
    async with session_maker() as session:
      district_manager = DistrictManager(session)
      for district_name in districts:
         new_district_id = await district_manager.add_district(district_name)
         if new_district_id is not None:
           print(f"Added district '{district_name}' with ID: {new_district_id}")
         else:
           print(f"Failed to add district '{district_name}'")


async def main():
    async with session_maker() as session:
      street_manager = StreetManager(session)
      for name in streets_17:
         new_id = await street_manager.add_street(name, 17)
         if new_id is not None:
           print(f"Added district '{name}' with ID: {new_id}")
         else:
           print(f"Failed to add district '{name}'")

if __name__ == "__main__":
  asyncio.run(main())
